a = 123
b = 1234
print('Id первоначального объекта:', id(a))
a = a + b
print('id объекта после a = a + 1234:', id(a))

a = 123

print(f'''

id первоначального объекта: {id(a)}''')

a += b

print('id после a += 1234:', id(a))

print('------------\n id не отличаются.\n\n\n')


a = [1, 2, 3]
b = [4, 5, 6, 7]
print('Id первоначального объекта:', id(a))
a = a + b
print('id объекта после a = a + 1234:', id(a))

a = [1, 2, 3]

print(f'''

id первоначального объекта: {id(a)}''')

a += b

print('id после a += 1234:', id(a))

print('------------\n id отличаются.')
